# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [34]:
import pandas as pd
import numpy as np
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [35]:
data1 = pd.Series([random.randint(1, 4) for _ in range(100)])
data2 = pd.Series([random.randint(1, 2) for _ in range(100)])
data3 = pd.Series([random.randint(10001,30000) for _ in range(100)])

### Step 3. Let's create a DataFrame by joinning the Series by column

In [36]:
data=pd.concat([data1,data2,data3],axis=1)
data.head()

   0  1      2
0  2  2  28137
1  4  1  19658
2  3  1  10453
3  2  2  27055
4  4  2  13314

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [37]:
data.rename(columns={0:"bedrs",1:"bathrs",2:"price_sqr_meter"},inplace=True)
data.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            28137
1      4       1            19658
2      3       1            10453
3      2       2            27055
4      4       2            13314

In [38]:
data.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            28137
1      4       1            19658
2      3       1            10453
3      2       2            27055
4      4       2            13314

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [42]:
bigcolumn=pd.concat([data1,data2,data3],axis=0)
bigcolumn=bigcolumn.to_frame()
bigcolumn

        0
0       2
1       4
2       3
3       2
4       4
..    ...
95  16406
96  14710
97  26475
98  12451
99  25465

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [43]:
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [44]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        2
1        4
2        3
3        2
4        4
..     ...
295  16406
296  14710
297  26475
298  12451
299  25465

[300 rows x 1 columns]